#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
module.rds.data.aws_region.current: Reading...
module.iam.data.aws_region.current: Reading...
module.rds.aws_ssm_parameter.db_username: Refreshing state... [id=/dev/database/username]
module.ecr.aws_ecr_repository.node_app: Refreshing state... [id=nodeapp]
module.ec2.data.aws_ami.ubuntu: Reading...
module.s3.data.aws_elb_service_account.main: Reading...
module.vpc.aws_ec2_managed_prefix_list.main: Refreshing state... [id=pl-008480f4310381376]
module.rds.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.iam.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07de0fded290784c6]
module.alb.data.aws_route53_zone.teachdev: Reading...
module.s3.data.aws_elb_service_account.main: Read complete after 0s [id=127311923021]
module.iam.data.aws_caller_identity.current: Reading...
module.iam.data.aws_iam_policy_document.ec2_assume_role_policy: Reading...
module.iam.data.aws_iam_policy_document.ec2_assume_role_policy: Read complete after 0s [id=2851119427]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_availability_zones.available: Reading...
module.rds.aws_ssm_parameter.db_region: Refreshing state... [id=/dev/database/region]
module.iam.aws_iam_role.ec2_instance_role: Refreshing state... [id=rds-iam-auth-ec2-role]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=442042522885]
module.iam.data.aws_iam_policy_document.rds_proxy_assume_role_policy: Reading...
module.iam.data.aws_iam_policy_document.rds_proxy_assume_role_policy: Read complete after 0s [id=2850166910]
module.iam.aws_iam_role.rds_proxy_role: Refreshing state... [id=rds-iam-auth-rds_proxy-role]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.ec2.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0071174ad8cbb9e17]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry: Refreshing state... [id=rds-iam-auth-ec2-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.iam.aws_iam_role_policy_attachment.ec2_ssm_managed: Refreshing state... [id=rds-iam-auth-ec2-role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.iam.aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=rds-iam-auth-instance-profile]
module.alb.data.aws_route53_zone.teachdev: Read complete after 1s [id=Z04674591DWQH0TB75W6L]
module.alb.data.aws_acm_certificate.issued: Reading...
module.alb.data.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-east-1:442042522885:certificate/b18bf6dc-8b86-4901-b055-9a8f37b4f6f2]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0c75a45532faa4677]
module.vpc.aws_subnet.private["us-east-1c"]: Refreshing state... [id=subnet-0fbc43b77e2879466]
module.security_group.aws_security_group.rds_proxy_sg: Refreshing state... [id=sg-0a934510bd61d0eeb]
module.vpc.aws_subnet.public["us-east-1a"]: Refreshing state... [id=subnet-0c6a0e552756a242b]
module.security_group.aws_security_group.alb_security_group: Refreshing state... [id=sg-0469bbea16b5c74ce]
module.vpc.aws_nat_gateway.main: Refreshing state... [id=nat-11183c5dd982fc538]
module.vpc.aws_subnet.private["us-east-1b"]: Refreshing state... [id=subnet-02ba672fa49f324e6]
module.vpc.aws_subnet.public["us-east-1b"]: Refreshing state... [id=subnet-0a97ea727c414d81c]
module.vpc.aws_subnet.private["us-east-1a"]: Refreshing state... [id=subnet-03c8205eb1c42e633]
module.vpc.aws_subnet.public["us-east-1c"]: Refreshing state... [id=subnet-035603f0efd41b5de]
module.security_group.aws_security_group.cloudshell_sg: Refreshing state... [id=sg-0fa414304509eb5c8]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-035a31198c6d111a4]
module.security_group.aws_security_group.ec2_instance_sg: Refreshing state... [id=sg-046481a898995619c]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-08cb397b9fc7c96aa]
module.security_group.aws_vpc_security_group_ingress_rule.alb_ingress_https: Refreshing state... [id=sgr-0695cdbc55a60d4a2]
module.security_group.aws_vpc_security_group_ingress_rule.alb_ingress_http: Refreshing state... [id=sgr-04f8e830a96a7320a]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-048472cb818b4348a]
module.security_group.aws_vpc_security_group_egress_rule.cloudshell_egress: Refreshing state... [id=sgr-06b0f3cf4638bd55f]
module.security_group.aws_vpc_security_group_egress_rule.alb_egress_ec2: Refreshing state... [id=sgr-0b48ed901140ba05c]
module.security_group.aws_vpc_security_group_egress_rule.ec2_ssm_egress_rule: Refreshing state... [id=sgr-067cf7c2e3201d502]
module.security_group.aws_vpc_security_group_ingress_rule.ec2_ingress_rule: Refreshing state... [id=sgr-03a8ead340b7c0195]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=rds-iam-auth-db-subnet-group]
module.vpc.aws_route_table_association.public["us-east-1c"]: Refreshing state... [id=rtbassoc-0874d2162aa10b035]
module.vpc.aws_route_table_association.public["us-east-1b"]: Refreshing state... [id=rtbassoc-07bc8561431f103eb]
module.vpc.aws_route_table_association.public["us-east-1a"]: Refreshing state... [id=rtbassoc-0bd2e4cd136272682]
module.vpc.aws_route_table_association.private["us-east-1b"]: Refreshing state... [id=rtbassoc-014dae90bc65c7aa4]
module.vpc.aws_route_table_association.private["us-east-1c"]: Refreshing state... [id=rtbassoc-06863fa58354c2bf3]
module.vpc.aws_route_table_association.private["us-east-1a"]: Refreshing state... [id=rtbassoc-0987184088a99c475]
module.rds.aws_db_instance.main: Refreshing state... [id=db-33DQNVJICMLJUTCX4BPFWB7BVY]
module.rds.aws_ssm_parameter.db_port: Refreshing state... [id=/dev/database/port]
module.security_group.aws_vpc_security_group_ingress_rule.rds_ingress_rule: Refreshing state... [id=sgr-040750b9a50c213dc]
module.iam.data.aws_iam_policy_document.rds_proxy_iam_policy: Reading...
module.rds.aws_ssm_parameter.db_name: Refreshing state... [id=/dev/database/dbname]
module.security_group.aws_vpc_security_group_egress_rule.ec2_egress_rule: Refreshing state... [id=sgr-04eea2f42801a415c]
module.security_group.aws_vpc_security_group_ingress_rule.rds_cloudshell_ingress: Refreshing state... [id=sgr-0983448cd3f405a09]
module.rds.aws_db_proxy.devdb_proxy: Refreshing state... [id=dev-node-app]
module.security_group.aws_vpc_security_group_egress_rule.proxy_to_rds: Refreshing state... [id=sgr-0e1d43d4a61451e32]
module.security_group.aws_vpc_security_group_ingress_rule.rds_proxy_ingress_rule: Refreshing state... [id=sgr-09136c0f52eba2f73]
module.iam.data.aws_iam_policy_document.rds_proxy_iam_policy: Read complete after 0s [id=142374272]
local_file.rds_config: Refreshing state... [id=c611bda6af4c33022d13d4e81fa57eb74ebeb02d]
module.iam.aws_iam_policy.rds_proxy_policy: Refreshing state... [id=arn:aws:iam::442042522885:policy/rds-iam-auth-rds-proxy-policy]
module.iam.aws_iam_role_policy_attachment.rds_proxy_policy_attachment: Refreshing state... [id=rds-iam-auth-rds_proxy-role/arn:aws:iam::442042522885:policy/rds-iam-auth-rds-proxy-policy]
module.rds.aws_db_proxy_default_target_group.main: Refreshing state... [id=dev-node-app]
module.rds.aws_ssm_parameter.db_enpoint: Refreshing state... [id=/dev/database/endpoint]
module.iam.data.aws_iam_policy_document.ec2_instance_iam_policy: Reading...
module.iam.data.aws_iam_policy_document.ec2_instance_iam_policy: Read complete after 0s [id=1147913119]
module.iam.aws_iam_policy.ssm_parameter_rds_proxy: Refreshing state... [id=arn:aws:iam::442042522885:policy/rds-iam-auth-ec2-instance-policy]
module.rds.aws_db_proxy_target.main: Refreshing state... [id=dev-node-app/default/RDS_INSTANCE/rds-iam-auth-db]
module.iam.aws_iam_role_policy_attachment.attach_ssm_rds_proxy: Refreshing state... [id=rds-iam-auth-ec2-role/arn:aws:iam::442042522885:policy/rds-iam-auth-ec2-instance-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.rds_config will be created
  + resource "local_file" "rds_config" {
      + content              = <<-EOT
            RDS_ENDPOINT="rds-iam-auth-db.czukae2w2p87.us-east-1.rds.amazonaws.com"
            REGION="us-east-1"
            MASTER_SECRET_NAME="rds!db-d11f67cd-a9cf-4745-af31-fcdb364f603c"
            DB_NAME="node_db"
            IAM_ADMIN_USER="dbadmin"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./rds.conf"
      + id                   = (known after apply)
    }

  # module.alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "rds-iam-auth-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = [
          + "sg-0469bbea16b5c74ce",
        ]
      + subnets                                                      = [
          + "subnet-035603f0efd41b5de",
          + "subnet-0a97ea727c414d81c",
          + "subnet-0c6a0e552756a242b",
        ]
      + tags                                                         = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "alb_access_logs"
        }

      + connection_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "alb_connection_logs"
        }

      + health_check_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "alb_health_check_logs"
        }

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:us-east-1:442042522885:certificate/b18bf6dc-8b86-4901-b055-9a8f37b4f6f2"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-Res-PQ-2025-09"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_listener.redirect will be created
  + resource "aws_lb_listener" "redirect" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.main will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "rds-iam-auth-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-07de0fded290784c6"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_lb_target_group_attachment.main will be created
  + resource "aws_lb_target_group_attachment" "main" {
      + id               = (known after apply)
      + port             = 3000
      + region           = "us-east-1"
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.alb.aws_route53_record.app will be created
  + resource "aws_route53_record" "app" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "app.teachdev.online"
      + type            = "A"
      + zone_id         = "Z04674591DWQH0TB75W6L"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.ec2.aws_instance.node_app_instance will be created
  + resource "aws_instance" "node_app_instance" {
      + ami                                  = "ami-0071174ad8cbb9e17"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "rds-iam-auth-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-03c8205eb1c42e633"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-node-app"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-node-app"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            
            sleep 60
            
            set -eux
            
            # Convert HTTP to HTTPS in sources file
            sudo sed -i 's|http://|https://|g' /etc/apt/sources.list.d/ubuntu.sources
            
            # update package repos
            sudo apt-get update -y
            
            
            # Add Docker's official GPG key:
            sudo apt-get install ca-certificates curl
            sudo install -m 0755 -d /etc/apt/keyrings
            sudo curl -fsSL https://download.docker.com/linux/ubuntu/gpg -o /etc/apt/keyrings/docker.asc
            sudo chmod a+r /etc/apt/keyrings/docker.asc
            
            # Add the repository to Apt sources:
            sudo tee /etc/apt/sources.list.d/docker.sources <<EOF
            Types: deb
            URIs: https://download.docker.com/linux/ubuntu
            Suites: $(. /etc/os-release && echo "${UBUNTU_CODENAME:-$VERSION_CODENAME}")
            Components: stable
            Signed-By: /etc/apt/keyrings/docker.asc
            EOF
            sudo apt-get update -y
            
            sudo apt-get -y install docker-ce docker-ce-cli containerd.io docker-buildx-plugin docker-compose-plugin
            
            # Install AWS CLI 
            sudo apt-get install unzip mysql-client -y
            sudo curl "https://awscli.amazonaws.com/awscli-exe-linux-x86_64.zip" -o "awscliv2.zip"
            unzip awscliv2.zip
            sudo ./aws/install
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-046481a898995619c",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = "gp3"
        }

      + secondary_network_interface (known after apply)
    }

  # module.s3.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "rds-iam-auth-alb-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-alb-logs"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-alb-logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.main will be created
  + resource "aws_s3_bucket_policy" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # module.s3.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-1"
      + restrict_public_buckets = true
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.main will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3.aws_s3_bucket_versioning.main will be created
  + resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name              = (known after apply)
  + alb_security_group        = "sg-0469bbea16b5c74ce"
  + alb_target_group_arn      = (known after apply)
  + ec2_instance_id           = (known after apply)
  + ec2_instance_private_ip   = (known after apply)
  + ec2_instance_profile_name = "rds-iam-auth-instance-profile"
  + s3_bucket_arn             = (known after apply)
  + s3_bucket_name            = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>
*Pushed by: @seunayolu*